In [1]:
import sqlite3

db = "emp_v.db"

conn = sqlite3.connect(db)

print ("Opened database successfully")

Opened database successfully

In [2]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

conn.execute('''CREATE TABLE COMPANY 
        (ID INT PRIMARY KEY  NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print ("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

In [3]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (5, 'David', 27, 'Texas ', 85000.0 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (6, 'Kim', 22, 'South-Hall ', 45000.0 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (7, 'James', 24, 'Houston ', 10000.0)");

conn.commit()
print ("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

### Query 0
Show all tables in Schema

sqlite_schema: A system table in SQLite that stores the schema (structure) of the database, 

      including tables, indexes, views, and triggers.

type IN ('table'): Filters only entries where the type is a table (ignores views, indexes, triggers, etc.).

    name: Returns the name of the table.

In [6]:
import sqlite3 as lite

con = lite.connect(db)

with con:

    cur = con.cursor()
    cur.execute("SELECT name FROM sqlite_master WHERE type='table'")

    rows = cur.fetchall()

    for row in rows:
        print (row)

('COMPANY',)

In [14]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

cursor = conn.execute("SELECT * from COMPANY ;")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("AGE = ", row[2])
    print ("ADDRESS = ", row[3])
    print ("SALARY = ", row[4], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
AGE =  25
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
AGE =  23
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

ID =  5
NAME =  David
AGE =  27
ADDRESS =  Texas
SALARY =  85000.0

ID =  6
NAME =  Kim
AGE =  22
ADDRESS =  South-Hall
SALARY =  45000.0

ID =  7
NAME =  James
AGE =  24
ADDRESS =  Houston
SALARY =  10000.0

Operation done successfully

### Query 1
SELECT statement lists down all the records where AGE is greater than or equal to 25 AND salary is greater than or equal to 65000.00.

In [15]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY WHERE AGE >= 25 AND SALARY >= 65000;")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("AGE = ", row[2])
    print ("ADDRESS = ", row[3])
    print ("SALARY = ", row[4], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

ID =  5
NAME =  David
AGE =  27
ADDRESS =  Texas
SALARY =  85000.0

Operation done successfully

### Query 2

SELECT statement lists down all the records where AGE is greater than or equal to 25 OR salary is greater than or equal to 65000.00.

In [16]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

cursor = conn.execute("SELECT * FROM COMPANY WHERE AGE >= 25 OR SALARY >= 65000;")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("AGE = ", row[2])
    print ("ADDRESS = ", row[3])
    print ("SALARY = ", row[4], "\n")
print ("Operation done successfully")
conn.close()

Opened database successfully
ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
AGE =  25
ADDRESS =  Texas
SALARY =  15000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

ID =  5
NAME =  David
AGE =  27
ADDRESS =  Texas
SALARY =  85000.0

Operation done successfully

### Query 3
SELECT statement lists down all the records where NAME starts with 'Ki'

In [17]:
import sqlite3 as lite

con = lite.connect(db)

with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY WHERE NAME LIKE 'P%';")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(1, 'Paul', 32, 'California', 20000.0)

| Pattern  | Matches                               |
| -------- | ------------------------------------- |
| `'A%'`   | Starts with A                         |
| `'%a'`   | Ends with a                           |
| `'%a%'`  | Contains 'a' anywhere                 |
| `'__a%'` | Third letter is 'a' (`_` is one char) |

### Query 4

SELECT statement lists down all the records where AGE value is either 25 or 27.

In [10]:
import sqlite3 as lite

con = lite.connect(db)

with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY WHERE AGE IN ( 25, 27 );")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(2, 'Allen', 25, 'Texas', 15000.0)
(4, 'Mark', 25, 'Rich-Mond ', 65000.0)
(5, 'David', 27, 'Texas ', 85000.0)

### Query 5
SELECT statement lists down all the records where AGE value is neither 25 nor 27

In [18]:
with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY WHERE AGE NOT IN ( 25, 27 );")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(1, 'Paul', 32, 'California', 20000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)
(6, 'Kim', 22, 'South-Hall ', 45000.0)
(7, 'James', 24, 'Houston ', 10000.0)

In [19]:
with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY WHERE NAME IN ( 'Paul', 'Teddy' );")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(1, 'Paul', 32, 'California', 20000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)

### Query 6
SELECT statement lists down all the records where AGE value is in BETWEEN 25 AND 27.

In [28]:
with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY WHERE AGE BETWEEN 25 AND 27;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(2, 'Allen', 25, 'Texas', 15000.0)
(4, 'Mark', 25, 'Rich-Mond ', 65000.0)
(5, 'David', 27, 'Texas ', 85000.0)
(10, 'Allen', 26, 'Texas', 15000.0)

### Query 7
SELECT statement lists down all the records where AGE is greater than or equal to 25

In [ ]:
with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY WHERE AGE >= 25;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

### Query 8
Following is an example, which will sort the result in descending order by SALARY.

In [22]:
with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY ORDER BY SALARY desc;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(5, 'David', 27, 'Texas ', 85000.0)
(4, 'Mark', 25, 'Rich-Mond ', 65000.0)
(6, 'Kim', 22, 'South-Hall ', 45000.0)
(1, 'Paul', 32, 'California', 20000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)
(2, 'Allen', 25, 'Texas', 15000.0)
(7, 'James', 24, 'Houston ', 10000.0)

In [23]:
with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY ORDER BY NAME;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(2, 'Allen', 25, 'Texas', 15000.0)
(5, 'David', 27, 'Texas ', 85000.0)
(7, 'James', 24, 'Houston ', 10000.0)
(6, 'Kim', 22, 'South-Hall ', 45000.0)
(4, 'Mark', 25, 'Rich-Mond ', 65000.0)
(1, 'Paul', 32, 'California', 20000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)

In [26]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

conn.execute("INSERT INTO COMPANY VALUES (10, 'Allen', 26, 'Texas', 15000.00 );");

conn.commit()
print ("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

In [27]:
with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY ;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(1, 'Paul', 32, 'California', 20000.0)
(2, 'Allen', 25, 'Texas', 15000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)
(4, 'Mark', 25, 'Rich-Mond ', 65000.0)
(5, 'David', 27, 'Texas ', 85000.0)
(6, 'Kim', 22, 'South-Hall ', 45000.0)
(7, 'James', 24, 'Houston ', 10000.0)
(8, 'Paul', 24, 'Houston', 20000.0)
(9, 'James', 44, 'Norway', 5000.0)
(10, 'Allen', 26, 'Texas', 15000.0)

### Query 10

In [29]:
import sqlite3

conn = sqlite3.connect(db)

with conn:

    cur = conn.cursor()
    cur.execute("SELECT NAME, SUM(SALARY) FROM COMPANY GROUP BY NAME;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

('Allen', 30000.0)
('David', 85000.0)
('James', 15000.0)
('Kim', 45000.0)
('Mark', 65000.0)
('Paul', 40000.0)
('Teddy', 20000.0)

In [30]:
import sqlite3

conn = sqlite3.connect(db)

with conn:

    cur = conn.cursor()
    cur.execute("SELECT count(*) FROM COMPANY ;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(10,)

GROUP BY
    
       The GROUP BY clause groups rows that have the same values in specified columns.

       It is often used with aggregate functions (COUNT(), SUM(), AVG(), etc.) to perform operations on each group of data.

HAVING
    
    HAVING is like WHERE but used after grouping to filter groups (not individual rows).

    WHERE filters before grouping, HAVING filters after.

#### Total Salary by Address

In [31]:
import sqlite3

conn = sqlite3.connect(db)

with conn:

    cur = conn.cursor()
    cur.execute("SELECT ADDRESS, SUM(SALARY) AS Total_Salary FROM COMPANY GROUP BY ADDRESS;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

('California', 20000.0)
('Houston', 20000.0)
('Houston ', 10000.0)
('Norway', 25000.0)
('Rich-Mond ', 65000.0)
('South-Hall ', 45000.0)
('Texas', 30000.0)
('Texas ', 85000.0)

#### Only show addresses where total salary > 50000

In [32]:
import sqlite3

conn = sqlite3.connect(db)

with conn:

    cur = conn.cursor()
    cur.execute("SELECT ADDRESS, SUM(SALARY) AS Total_Salary FROM COMPANY GROUP BY ADDRESS HAVING SUM(SALARY) > 50000;")

    rows = cur.fetchall()

    for row in rows:
        print (row)

('Rich-Mond ', 65000.0)
('Texas ', 85000.0)